my_reddit/app/controllers/comments_controller.rb

    def create

        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id
        if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "come and get mee~!"], ["author_id", 1], ["post_id", 1], ["created_at", "2019-04-09 23:49:41.405023"], ["updated_at", "2019-04-09 23:49:41.405023"], ["parent_comment_id", 2]]