my_reddit/app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    if current_user.id == @post.author_id && @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "hrtwaegr"], ["updated_at", "2019-04-09 21:46:33.804577"], ["id", 3]]

  def upvote
    @post = Post.find(params[:post_id])
    @all_comments = @post.comments_by_parent_id
    Vote.create(value: 1, votable_type: Post, votable_id: params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("value", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", 1], ["votable_type", "Post"], ["votable_id", 1], ["created_at", "2019-04-10 00:34:56.800720"], ["updated_at", "2019-04-10 00:34:56.800720"]]

  def downvote
    @post = Post.find(params[:post_id])
    @all_comments = @post.comments_by_parent_id
    Vote.create(value: -1, votable_type: Post, votable_id: params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("value", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", -1], ["votable_type", "Post"], ["votable_id", 1], ["created_at", "2019-04-10 00:38:12.685320"], ["updated_at", "2019-04-10 00:38:12.685320"]]