my_reddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("created_at", "updated_at", "title", "description", "moderator_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-04-09 18:58:16.354668"], ["updated_at", "2019-04-09 18:58:16.354668"], ["title", "my very first sub"], ["description", "asdfaewefarv"], ["moderator_id", 1]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "very cool stuff"], ["updated_at", "2019-04-09 19:07:07.857385"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])
    if current_user.id == @sub.moderator_id && @sub.update(sub_params)

SELECT "subs".* FROM "subs"
---
  def index
    #maybe filter logic from query string
    @subs = Sub.all