my_reddit/app/views/posts/edit.html.erb

    <h3>Subs to Post to</h3>
    <%Sub.all.each do |sub|%>
---
SELECT "subs".* FROM "subs"

            value="<%=sub.id%>"
            <%= "checked" if @post.sub_ids.include?(sub.id)%>>
---
SELECT "subs"."id" FROM "subs" INNER JOIN "subtags" ON "subs"."id" = "subtags"."sub_id" WHERE "subtags"."post_id" = $1  [["post_id", 2]]