my_reddit/app/views/posts/new.html.erb

        <h3>Subs to Post to</h3>
        <%Sub.all.each do |sub|%>
---
SELECT "subs".* FROM "subs"