my_reddit/app/views/posts/show.html.erb

<ul>
    <% @post.subs.each do |sub|%>
---
SELECT "subs".* FROM "subs" INNER JOIN "subtags" ON "subs"."id" = "subtags"."sub_id" WHERE "subtags"."post_id" = $1  [["post_id", 1]]