my_reddit/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "subtags" ON "posts"."id" = "subtags"."post_id" WHERE "subtags"."sub_id" = $1  [["sub_id", 2]]
---
<ul>
    <% @sub.posts.each do |post|%>